zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRU.h
#define MRU_NOTIFY_CH4_IS0_MASK                  (0x8U)
#define MRU_NOTIFY_CH4_IS0_SHIFT                 (3U)
#define MRU_NOTIFY_CH4_IS0_WIDTH                 (1U)
#define MRU_NOTIFY_CH4_IS0(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH4_IS0_SHIFT)) & MRU_NOTIFY_CH4_IS0_MASK)

#define MRU_NOTIFY_CH4_IS1_MASK                  (0x8U)
#define MRU_NOTIFY_CH4_IS1_SHIFT                 (3U)
#define MRU_NOTIFY_CH4_IS1_WIDTH                 (1U)
#define MRU_NOTIFY_CH4_IS1(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH4_IS1_SHIFT)) & MRU_NOTIFY_CH4_IS1_MASK)

#define MRU_NOTIFY_CH4_IS2_MASK                  (0x8U)
#define MRU_NOTIFY_CH4_IS2_SHIFT                 (3U)
#define MRU_NOTIFY_CH4_IS2_WIDTH                 (1U)
#define MRU_NOTIFY_CH4_IS2(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH4_IS2_SHIFT)) & MRU_NOTIFY_CH4_IS2_MASK)

#define MRU_NOTIFY_CH4_IS3_MASK                  (0x8U)
#define MRU_NOTIFY_CH4_IS3_SHIFT                 (3U)
#define MRU_NOTIFY_CH4_IS3_WIDTH                 (1U)
#define MRU_NOTIFY_CH4_IS3(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH4_IS3_SHIFT)) & MRU_NOTIFY_CH4_IS3_MASK)

#define MRU_NOTIFY_CH5_IS0_MASK                  (0x10U)
#define MRU_NOTIFY_CH5_IS0_SHIFT                 (4U)
#define MRU_NOTIFY_CH5_IS0_WIDTH                 (1U)
#define MRU_NOTIFY_CH5_IS0(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH5_IS0_SHIFT)) & MRU_NOTIFY_CH5_IS0_MASK)

#define MRU_NOTIFY_CH5_IS1_MASK                  (0x10U)
#define MRU_NOTIFY_CH5_IS1_SHIFT                 (4U)
#define MRU_NOTIFY_CH5_IS1_WIDTH                 (1U)
#define MRU_NOTIFY_CH5_IS1(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH5_IS1_SHIFT)) & MRU_NOTIFY_CH5_IS1_MASK)

#define MRU_NOTIFY_CH5_IS2_MASK                  (0x10U)
#define MRU_NOTIFY_CH5_IS2_SHIFT                 (4U)
#define MRU_NOTIFY_CH5_IS2_WIDTH                 (1U)
#define MRU_NOTIFY_CH5_IS2(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH5_IS2_SHIFT)) & MRU_NOTIFY_CH5_IS2_MASK)

#define MRU_NOTIFY_CH5_IS3_MASK                  (0x10U)
#define MRU_NOTIFY_CH5_IS3_SHIFT                 (4U)
#define MRU_NOTIFY_CH5_IS3_WIDTH                 (1U)
#define MRU_NOTIFY_CH5_IS3(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH5_IS3_SHIFT)) & MRU_NOTIFY_CH5_IS3_MASK)

#define MRU_NOTIFY_CH6_IS0_MASK                  (0x20U)
#define MRU_NOTIFY_CH6_IS0_SHIFT                 (5U)
#define MRU_NOTIFY_CH6_IS0_WIDTH                 (1U)
#define MRU_NOTIFY_CH6_IS0(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH6_IS0_SHIFT)) & MRU_NOTIFY_CH6_IS0_MASK)

#define MRU_NOTIFY_CH6_IS1_MASK                  (0x20U)
#define MRU_NOTIFY_CH6_IS1_SHIFT                 (5U)
#define MRU_NOTIFY_CH6_IS1_WIDTH                 (1U)
#define MRU_NOTIFY_CH6_IS1(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH6_IS1_SHIFT)) & MRU_NOTIFY_CH6_IS1_MASK)

#define MRU_NOTIFY_CH6_IS2_MASK                  (0x20U)
#define MRU_NOTIFY_CH6_IS2_SHIFT                 (5U)
#define MRU_NOTIFY_CH6_IS2_WIDTH                 (1U)
#define MRU_NOTIFY_CH6_IS2(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH6_IS2_SHIFT)) & MRU_NOTIFY_CH6_IS2_MASK)

#define MRU_NOTIFY_CH6_IS3_MASK                  (0x20U)
#define MRU_NOTIFY_CH6_IS3_SHIFT                 (5U)
#define MRU_NOTIFY_CH6_IS3_WIDTH                 (1U)
#define MRU_NOTIFY_CH6_IS3(x)                    (((uint32_t)(((uint32_t)(x)) << MRU_NOTIFY_CH6_IS3_SHIFT)) & MRU_NOTIFY_CH6_IS3_MASK)
/*! @} */

/*! @name CH1_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH1_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH1_MB0_MBD_SHIFT                    (0U)
#define MRU_CH1_MB0_MBD_WIDTH                    (32U)
#define MRU_CH1_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH1_MB0_MBD_SHIFT)) & MRU_CH1_MB0_MBD_MASK)
/*! @} */

/*! @name CH1_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH1_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH1_MB1_MBD_SHIFT                    (0U)
#define MRU_CH1_MB1_MBD_WIDTH                    (32U)
#define MRU_CH1_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH1_MB1_MBD_SHIFT)) & MRU_CH1_MB1_MBD_MASK)
/*! @} */

/*! @name CH1_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH1_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH1_MB2_MBD_SHIFT                    (0U)
#define MRU_CH1_MB2_MBD_WIDTH                    (32U)
#define MRU_CH1_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH1_MB2_MBD_SHIFT)) & MRU_CH1_MB2_MBD_MASK)
/*! @} */

/*! @name CH1_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH1_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH1_MB3_MBD_SHIFT                    (0U)
#define MRU_CH1_MB3_MBD_WIDTH                    (32U)
#define MRU_CH1_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH1_MB3_MBD_SHIFT)) & MRU_CH1_MB3_MBD_MASK)
/*! @} */

/*! @name CH2_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH2_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH2_MB0_MBD_SHIFT                    (0U)
#define MRU_CH2_MB0_MBD_WIDTH                    (32U)
#define MRU_CH2_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH2_MB0_MBD_SHIFT)) & MRU_CH2_MB0_MBD_MASK)
/*! @} */

/*! @name CH2_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH2_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH2_MB1_MBD_SHIFT                    (0U)
#define MRU_CH2_MB1_MBD_WIDTH                    (32U)
#define MRU_CH2_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH2_MB1_MBD_SHIFT)) & MRU_CH2_MB1_MBD_MASK)
/*! @} */

/*! @name CH2_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH2_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH2_MB2_MBD_SHIFT                    (0U)
#define MRU_CH2_MB2_MBD_WIDTH                    (32U)
#define MRU_CH2_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH2_MB2_MBD_SHIFT)) & MRU_CH2_MB2_MBD_MASK)
/*! @} */

/*! @name CH2_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH2_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH2_MB3_MBD_SHIFT                    (0U)
#define MRU_CH2_MB3_MBD_WIDTH                    (32U)
#define MRU_CH2_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH2_MB3_MBD_SHIFT)) & MRU_CH2_MB3_MBD_MASK)
/*! @} */

