zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRU.h
/*! @name CH3_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH3_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH3_MB0_MBD_SHIFT                    (0U)
#define MRU_CH3_MB0_MBD_WIDTH                    (32U)
#define MRU_CH3_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH3_MB0_MBD_SHIFT)) & MRU_CH3_MB0_MBD_MASK)
/*! @} */

/*! @name CH3_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH3_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH3_MB1_MBD_SHIFT                    (0U)
#define MRU_CH3_MB1_MBD_WIDTH                    (32U)
#define MRU_CH3_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH3_MB1_MBD_SHIFT)) & MRU_CH3_MB1_MBD_MASK)
/*! @} */

/*! @name CH3_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH3_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH3_MB2_MBD_SHIFT                    (0U)
#define MRU_CH3_MB2_MBD_WIDTH                    (32U)
#define MRU_CH3_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH3_MB2_MBD_SHIFT)) & MRU_CH3_MB2_MBD_MASK)
/*! @} */

/*! @name CH3_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH3_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH3_MB3_MBD_SHIFT                    (0U)
#define MRU_CH3_MB3_MBD_WIDTH                    (32U)
#define MRU_CH3_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH3_MB3_MBD_SHIFT)) & MRU_CH3_MB3_MBD_MASK)
/*! @} */

/*! @name CH4_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH4_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH4_MB0_MBD_SHIFT                    (0U)
#define MRU_CH4_MB0_MBD_WIDTH                    (32U)
#define MRU_CH4_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH4_MB0_MBD_SHIFT)) & MRU_CH4_MB0_MBD_MASK)
/*! @} */

/*! @name CH4_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH4_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH4_MB1_MBD_SHIFT                    (0U)
#define MRU_CH4_MB1_MBD_WIDTH                    (32U)
#define MRU_CH4_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH4_MB1_MBD_SHIFT)) & MRU_CH4_MB1_MBD_MASK)
/*! @} */

/*! @name CH4_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH4_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH4_MB2_MBD_SHIFT                    (0U)
#define MRU_CH4_MB2_MBD_WIDTH                    (32U)
#define MRU_CH4_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH4_MB2_MBD_SHIFT)) & MRU_CH4_MB2_MBD_MASK)
/*! @} */

/*! @name CH4_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH4_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH4_MB3_MBD_SHIFT                    (0U)
#define MRU_CH4_MB3_MBD_WIDTH                    (32U)
#define MRU_CH4_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH4_MB3_MBD_SHIFT)) & MRU_CH4_MB3_MBD_MASK)
/*! @} */

/*! @name CH5_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH5_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH5_MB0_MBD_SHIFT                    (0U)
#define MRU_CH5_MB0_MBD_WIDTH                    (32U)
#define MRU_CH5_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH5_MB0_MBD_SHIFT)) & MRU_CH5_MB0_MBD_MASK)
/*! @} */

/*! @name CH5_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH5_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH5_MB1_MBD_SHIFT                    (0U)
#define MRU_CH5_MB1_MBD_WIDTH                    (32U)
#define MRU_CH5_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH5_MB1_MBD_SHIFT)) & MRU_CH5_MB1_MBD_MASK)
/*! @} */

/*! @name CH5_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH5_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH5_MB2_MBD_SHIFT                    (0U)
#define MRU_CH5_MB2_MBD_WIDTH                    (32U)
#define MRU_CH5_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH5_MB2_MBD_SHIFT)) & MRU_CH5_MB2_MBD_MASK)
/*! @} */

/*! @name CH5_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH5_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH5_MB3_MBD_SHIFT                    (0U)
#define MRU_CH5_MB3_MBD_WIDTH                    (32U)
#define MRU_CH5_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH5_MB3_MBD_SHIFT)) & MRU_CH5_MB3_MBD_MASK)
/*! @} */

/*! @name CH6_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH6_MB0_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH6_MB0_MBD_SHIFT                    (0U)
#define MRU_CH6_MB0_MBD_WIDTH                    (32U)
#define MRU_CH6_MB0_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH6_MB0_MBD_SHIFT)) & MRU_CH6_MB0_MBD_MASK)
/*! @} */

/*! @name CH6_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH6_MB1_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH6_MB1_MBD_SHIFT                    (0U)
#define MRU_CH6_MB1_MBD_WIDTH                    (32U)
#define MRU_CH6_MB1_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH6_MB1_MBD_SHIFT)) & MRU_CH6_MB1_MBD_MASK)
/*! @} */

/*! @name CH6_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH6_MB2_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH6_MB2_MBD_SHIFT                    (0U)
#define MRU_CH6_MB2_MBD_WIDTH                    (32U)
#define MRU_CH6_MB2_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH6_MB2_MBD_SHIFT)) & MRU_CH6_MB2_MBD_MASK)
/*! @} */

/*! @name CH6_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define MRU_CH6_MB3_MBD_MASK                     (0xFFFFFFFFU)
#define MRU_CH6_MB3_MBD_SHIFT                    (0U)
#define MRU_CH6_MB3_MBD_WIDTH                    (32U)
#define MRU_CH6_MB3_MBD(x)                       (((uint32_t)(((uint32_t)(x)) << MRU_CH6_MB3_MBD_SHIFT)) & MRU_CH6_MB3_MBD_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MRU_Register_Masks */

/*!
 * @}
 */ /* end of group MRU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MRU_H_) */
